perf/space_news.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555/api'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Ramp
      duration: 30
      arrivalRate: 2
      rampTo: 15
    - name: Plain
      duration: 60
      arrivalRate: 15
    - name: Ramp down
      duration: 30
      arrivalRate: 15
      rampTo: 2
    - name: Stop
      duration: 30
      arrivalRate: 1
    

scenarios:
  - name: Space News (/space_news)
    flow:
      - get:
          url: '/space_news'